# HiddenBeamsEditingWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..HiddenBeamsEditingWarning Property
BuiltInFailures..::..EditingFailures Class See Also
---
The beam join being modified contains beam that are not visible. Geometry of visible beams may be affected by hidden beams.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HiddenBeamsEditingWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HiddenBeamsEditingWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HiddenBeamsEditingWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace